---
title: MEPAnalyticalSystem
classe: Autodesk.Revit.DB.Mechanical.MEPAnalyticalSystem
namespace: Autodesk.Revit.DB.Mechanical
eredita: Autodesk.Revit.DB.Element
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 4
---

# MEPAnalyticalSystem

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `AnalyticalSystemDomain AnalyticalSystemDomain { get; }` | `mEPAnalyticalSystem.AnalyticalSystemDomain` | AnalyticalSystemDomain |
| `MEPAnalyticalSystem Create(Document, AnalyticalSystemDomain, String)` | `MEPAnalyticalSystem.Create(document, domain, name)` | MEPAnalyticalSystem |
| `AirSystemData GetAirSystemData()` | `mEPAnalyticalSystem.GetAirSystemData()` | AirSystemData |
| `WaterLoopData GetWaterLoopData()` | `mEPAnalyticalSystem.GetWaterLoopData()` | WaterLoopData |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```